17-rails-forms/app/controllers/snacks_controller.rb

SELECT "snacks".* FROM "snacks"
---
  def index
    @snacks = Snack.all

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @snack = Snack.find(params[:id])

SELECT  "snacks".* FROM "snacks" WHERE "snacks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @snack = Snack.find(params[:id])